src/org/php-security-check-list.org
#+TITLE: php security check list
#+LINK:https://github.com/ismailtasdelen/php-security-check-list/edit/master/README.md

* [[https://www.owasp.org/index.php/Full_Path_Disclosure][Full Path Disclosure]]
* [[https://www.owasp.org/index.php/Unrestricted_File_Upload][Arbitrary File Upload]]
* [[https://www.acunetix.com/vulnerabilities/web/arbitrary-file-deletion/][Arbitrary File Delete]]
* [[https://resources.infosecinstitute.com/arbitrary-file-download-breaking-into-the-system/#gref][Arbitrary File Download]]
* [[https://www.offensive-security.com/metasploit-unleashed/file-inclusion-vulnerabilities/][Local File Inclusion]]
* [[https://www.owasp.org/index.php/Testing_for_Remote_File_Inclusion][Remote File Inclusion]]
* [[https://www.owasp.org/index.php/Testing_for_cookies_attributes_(OTG-SESS-002)][Cookie Injection]]
* [[https://www.owasp.org/index.php/Testing_for_HTTP_Parameter_pollution_(OTG-INPVAL-004)][Header Injection]]
* [[https://www.owasp.org/index.php/SQL_Injection][SQL Injection]]
* [[https://www.owasp.org/index.php/Testing_for_XML_Injection_(OTG-INPVAL-008)][XML Injection]]
* [[https://www.owasp.org/index.php/XML_External_Entity][XXE Injection]]
* [Email Injection](https://www.owasp.org/index.php/Testing_for_IMAP/SMTP_Injection_(OTG-INPVAL-011))
* [HTML Injection](https://www.owasp.org/index.php/Testing_for_HTML_Injection_(OTG-CLIENT-003))
* [xPath Injection](https://www.owasp.org/index.php/XPATH_Injection)
* [Code Injection](https://www.owasp.org/index.php/Code_Injection)
* [Command Injection](https://www.owasp.org/index.php/Command_Injection)
* [Object Injection](https://www.owasp.org/index.php/PHP_Object_Injection)
* [Cross Site Scripting](https://www.owasp.org/index.php/Cross-site_Scripting_(XSS))
* [Cross Site Request Forgery](https://www.owasp.org/index.php/Cross-Site_Request_Forgery_(CSRF))
* [Broken Authentication and Session Management](https://www.owasp.org/index.php/Broken_Authentication_and_Session_Management)

